//Done by student: Vitaliy Syniak
//Group: 121-1
//Practice 1.5

#include <iostream>
#include <vector>

using namespace std;

int main() {
    // Task #1
    {
        int n, P;

        cout << "Enter number of elements: ";
        cin >> n; // Юзер вводить кількість елементів які будуть в масиві

        cout << "Set this elements:" << endl;
        vector<int> mas(n); // Створюємо динамічний масив з кількістю елементів яку буде задавати юзер
        for (int i = 0; i < n; i++) {
            cin >> mas[i]; // Задаємо значення елементів цього масиву циклом
        }

        cout << "Enter element P to check: ";
        cin >> P; // Вводимо елемент для перевірки

        bool found = false;
        for (int i = 0; i < n; i++) {
            if (mas[i] == P) { // Перевіряємо, якщо значення P == значенню певного елемента масиву,
                               // то виводимо індекс цього елемента
                cout << "The element is on position: " << i << endl; // Якщо умова того, що ми знайшли потрібний елемент істина,
                                                                     // то буде виведено відповідне повідомлення
                found = true;
                break;
            }
        }

        if (found == false) { // Якщо елемент не знайдено, то буде виведено це
            cout << "No such elements in the array" << endl;
        }
    }

    // Task #2
    {
        int n;

        cout << "Enter number of elements: ";
        cin >> n; // Знову користувач вводить кількість елементів які будуть в масиві

        cout << "Set this elements:" << endl;
        vector<int> mas(n); // Знову створюємо динамічний масив з кількістю елементів яку буде задавати юзер
        for (int i = 0; i < n; i++) {
            cin >> mas[i]; // Задаємо значення елементів цього масиву циклом
        }

        int minPosVal = -1;  // Якщо не буде елементів які додатні, то виведемо значення -1(таких значень нема)
        bool posVal = false;  // Якщо в масиві буде додатнє значення, то будемо змінювати значення
                                     // цієї змінної і використовувати в умовних операторах

        for (int i = 0; i < n; i++) { // Циклом знову перебираємо всі елементи масиву
            if (mas[i] > 0) {  // Перевіряємо, чи є елемент більше 0, тобто додатнім
                if (posVal != false || mas[i] < minPosVal) {  // Якщо жодного додатнього елемента ще не знайдено
                                                              // або поточний елемент масиву менший за поточне мінімальне додатнє значення
                    minPosVal = mas[i]; // Ми перезаписуємо наше мінімальне значення -1,
                                        // на значення поточного елемента якщо воно менше за це значення -1
                    posVal = true; // І змінюємо значення нашої змінної на true щоб використати далі в умовному операторі
                }
            }
        }

        if (posVal == true) { // Якщо найменший елемент був знайдений і ця умова істинна, то буде виведено відповідне повідомлення
            cout << "Minimal value = " << minPosVal << endl;
        } else { // Якщо хибна, то буде виведено це повідомлення
            cout << "No positive elements" << endl;
        }
    }

    // Task #3
    {
        int n;

        cout << "Enter number of elements: ";
        cin >> n; // Ну і востаннє задаємо кількість елементів масиву

        cout << "Set this elements:" << endl;
        vector<int> mas(n);
        for (int i = 0; i < n; i++) {
            cin >> mas[i]; // Ще раз задаємо значення елементів цього масиву циклом
        }

        int minIndex = 0; // Ініціалізую індекси мінімального
        int maxIndex = 0; // і максимального значень

        for (int i = 1; i < n; i++) { // Завдяки циклу проходимо по всім елементам і записуємо
                                      // мінімальне та максимальне значення в змінні які були ініційовані раніше
            if (mas[i] < mas[minIndex]) { // Якщо значення поточного елемента < за те що я задав(0) то перезапишемо його
                minIndex = i;  // Зберігаю індекс числа мінімального значення
            }
            if (mas[i] > mas[maxIndex]) {
                maxIndex = i;  // Зберігаю індекс числа з максимальним значенням
            }
        }

        cout << "Min value = " << mas[minIndex] << endl; // Вивожу для наглядності мінімальне значення
        cout << "Max value = " << mas[maxIndex] << endl; // І максимальне

        int temp = mas[minIndex]; // Створюю тимчасову змінну для зміни значень між елементами
        mas[minIndex] = mas[maxIndex]; // Наступні 2 строчки процес обміну значень
        mas[maxIndex] = temp;

        cout << "Min value = " << mas[minIndex] << endl; // Вивожу значення яке було заміненл максимальним
        cout << "Max value = " << mas[maxIndex] << endl; // І значення яке було замінено мінімальним
    }

    return 0;
}
